"""地图数据：定义长征路线兴趣点（POI）"""

POIS = [
    {
        "name": '杭州市文一街小学',
        "x": 525,
        "y": 700,
        "radius": 10,
        "image": 'xiaomenkou.webp',
        "intro": '杭州市文一街小学是杭州市西湖区教育局下属公办小学，创办于1951年2月，现有文一、师苑、云庐三个校区，教学班86个，学生3760人，教职工250人。学校前身为丁家村小学，历经杭州工学院附小、浙大附小等名称，1993年更名杭州师范学院附属小学，2015年组建文一教育集团。\n\n学校占地总面积超4.5万平方米，配备计算机681台、多媒体教室71间，纸质图书72390册，建有校园网络系统及闭路电视教学系统。教职工中含全国优秀教师1人、特级教师1人，设首席教师工作室4个。获评浙江省绿色学校、浙江省治安安全示范单位、浙江省优秀家长学校、杭州市人民群众满意学校、杭州市文明学校、杭州市依法治校示范校、杭州市智慧校园建设示范校、杭州市中小学美丽学校重点培育校，承担教育部"国培项目"校长培训基地、马云乡村教育家校长跟岗实践基地、中央教科所素质教育实验基地及多所师范院校教育实习基地等职能。',
    },
    {
        "name": '中心操场',
        "x": 490,
        "y": 360,
        "radius": 40,
        "intro": '主要是同学们练习足球绕杆和玩耍的地方。\n\n.',
    },
    {
        "name": '大操场',
        "x": 830,
        "y": 440,
        "radius": 40,
        "intro": '主要是同学们上体育课的地方，也是同学们进行运动活动的好地方，还是升旗的地方。\n\n大部分的体育设施都集中在此，如篮球场、足球场、跑步道等。\n\n',
    },
    {
        "name": '南楼',
        "x": 619,
        "y": 320,
        "radius": 40,
        "intro": '南楼主要包括三、四、五、六年级的教室、教师办公室、大礼堂、心理辅导室、医护室\n\n',
    },
    {
        "name": '北楼',
        "x": 360,
        "y": 320,
        "radius": 40,
        "intro": '北楼主要包括一二年级的教室、校长办公室、音乐教室、科学教室等\n\n',
    },
    {
        "name": '校医护室',
        "x": 700,
        "y": 690,
        "radius": 40,
        "intro": '同学们在出现疾病或者伤害时，进行及时的医疗处理的地方。\n\n.',
    },
    {
        "name": '601班',
        "x": 800,
        "y": 600,
        "radius": 40,
        "intro": '是我学习的地方，也是同学们进行学习活动的好地方。\n\n.',
    },
]
